{
  "backend/main.mo": "Defines core backend actor with authorization, storage mixins, Stripe config, and data models for users, deals, buyers, contracts, analytics, and payment sessions.",
  "feature_evidence.json": "Lists features, related files, components, tests, and confidence levels for navigation, responsiveness, and UI error‑fix work.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of each frontend file including pages, components, hooks, and styling.",
  "frontend/index.css": "Global Tailwind-driven OKLCH color theme defining light/dark tokens and base styling.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root app component handling authentication, backend/identity initialization, routing, and payment result pages with robust error states.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access-denied message with optional back button using card UI components.",
  "frontend/src/components/AnalysisResultCard.tsx": "Renders detailed deal analysis data including ARV, MAO, comps, and rating badge.",
  "frontend/src/components/AppShell.tsx": "Main application shell that manages navigation, mobile menu, lazy‑loaded pages, and logout logic based on user profile state.",
  "frontend/src/components/AppShellErrorBoundary.tsx": "Error boundary component that catches rendering errors in the app shell and displays a fallback interface with reset support.",
  "frontend/src/components/BuyerCard.tsx": "Displays a compact summary of a buyer with contact info, budget, areas, and an edit trigger.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Dialog for creating, editing, and deleting buyers with form state and backend mutations.",
  "frontend/src/components/ContractList.tsx": "Fetches and displays contracts for a deal with loading, error, and download handling.",
  "frontend/src/components/ContractUploader.tsx": "Uploads contract documents with validation, progress tracking, and backend submission.",
  "frontend/src/components/DealCard.tsx": "Shows a summary of a real estate deal including address, seller, ARV, offer, and estimated profit with an edit option.",
  "frontend/src/components/DealEditorDialog.tsx": "Modal form for creating, editing, and deleting deals with field state management and query mutations.",
  "frontend/src/components/FeatureLock.tsx": "Displays a locked feature card prompting users to upgrade their membership tier.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Builds a 6‑month bar chart of profit and estimated fees from deal data.",
  "frontend/src/components/PageQueryErrorState.tsx": "Generic error state component with retry, secondary actions, and optional contact support.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Dialog prompting new users to enter basic profile info and save it to the backend.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a table listing total profit aggregated by zip code.",
  "frontend/src/components/SignInScreen.tsx": "Sign‑in page using Internet Identity with branding and feature highlights.",
  "frontend/src/components/StartupErrorScreen.tsx": "Startup error screen offering retry and contact support options.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Initial loading screen showing branding and a spinner while the app initializes.",
  "frontend/src/hooks/useActor.ts": "Creates and refreshes a backend actor based on Internet Identity, auto‑initializing admin access and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBackendActor.ts": "Builds a backend actor with safer admin‑token handling, exposes loading/error states, and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity auth context that loads, manages, and exposes user identity and login state to the app.",
  "frontend/src/hooks/useMediaQuery.ts": "React hook for tracking CSS media‑query matches, with a helper for detecting mobile screens.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with react‑query, providing typed data fetching, mutations, and normalized error handling for profiles, deals, admin checks, and more.",
  "frontend/src/index.css": "Tailwind base styling plus custom CSS variables defining the app’s dark theme color system and typography rules.",
  "frontend/src/lib/copy.ts": "Centralized text copy for navigation labels, errors, empty states, locked features, admin UI, and support messaging.",
  "frontend/src/lib/dealMath.ts": "Utility functions for calculating MAO, estimated profit, and assignment fees in deals.",
  "frontend/src/lib/membership.ts": "Helpers determining feature access and limits based on membership tier, plus a utility for generating locked‑feature messages.",
  "frontend/src/lib/money.ts": "Formats bigint cents to USD strings and parses USD strings back into bigint cents.",
  "frontend/src/lib/support.ts": "Support utilities for generating and opening mailto links to the app’s support email.",
  "frontend/src/main.tsx": "Initializes React app root with QueryClient and InternetIdentity providers and mounts the main App component.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface for managing membership pricing, granting tiers, and configuring Stripe, with stateful forms and access control.",
  "frontend/src/pages/AnalyticsPage.tsx": "Enterprise‑only analytics dashboard showing performance metrics and profit-by-zip table with loading and error handling.",
  "frontend/src/pages/BuyersListPage.tsx": "Pro/Enterprise‑tier page for listing, creating, and editing buyers with dialogs, error states, and access gating.",
  "frontend/src/pages/ContractsPage.tsx": "Enterprise‑only contracts manager allowing users to select deals, upload documents, and view contract lists with error fallbacks.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard summarizing deal metrics, charts, and membership info with loading and error handling.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "AI‑powered deal analyzer that processes property addresses, displays results, and allows adding analyzed deals to the pipeline.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Renders the deals pipeline UI, fetching user deals, enforcing membership limits, and providing deal creation/editing dialogs across pipeline stages.",
  "frontend/src/pages/MembershipPage.tsx": "Displays membership tiers and pricing, allowing users to initiate Stripe checkout sessions for upgrades with monthly or annual billing.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment-canceled message, extracts the Stripe session ID, and provides navigation options to retry or return to the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles successful Stripe checkouts by confirming membership purchase, updating the user profile, and displaying success or error states.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions for reading, storing, and clearing URL parameters and session-stored values, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, fonts, and plugins for the app's UI design system.",
  "project_state.json": "Describes project metadata, known issues, and feature requirements, indicating the app has navigation and sidebar bugs to resolve."
}