{
  "backend/main.mo": "Defines the main canister actor with storage mixins, access control, and all data models for membership, users, deals, buyers, contracts, analytics, and ID counters.",
  "backend/migration.mo": "Implements migration logic that updates membership pricing if old defaults are detected while preserving custom admin pricing.",
  "feature_evidence.json": "Contains feature evidence entries linking frontend file changes to membership pricing updates and monthly pricing display requirements.",
  "frontend-file-summaries.txt": "Provides a mapping of frontend file paths to short summaries describing each component or page’s functionality.",
  "frontend/index.css": "Global Tailwind-based theme and color variable definitions for light and dark modes.",
  "frontend/index.html": "HTML entry point that loads the React application root and main script.",
  "frontend/src/App.tsx": "Main React entry managing authentication, theme, actor initialization, profile loading, and lazy-loading the app shell.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen showing an access-denied message with an optional back button.",
  "frontend/src/components/AnalysisResultCard.tsx": "Component displaying AI deal analysis results including ARV, MAO, comps, and rating with styled badges.",
  "frontend/src/components/AppShell.tsx": "Provides the main app layout with a sidebar, page navigation, lazy‑loaded pages, and logout handling.",
  "frontend/src/components/BuyerCard.tsx": "Displays a compact buyer summary with contact info, preferences, and an edit button.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Modal dialog for creating, updating, and deleting buyers with form fields and validation.",
  "frontend/src/components/ContractList.tsx": "Fetches and lists contract files for a deal, showing errors, loading states, and view buttons.",
  "frontend/src/components/ContractUploader.tsx": "Handles contract file selection, validation, and upload with progress tracking.",
  "frontend/src/components/DealCard.tsx": "Shows a brief deal summary including address, seller, ARV, offer, and estimated profit with edit control.",
  "frontend/src/components/DealEditorDialog.tsx": "Modal for creating or editing deals, managing fields like stage, pricing, buyers, and notes.",
  "frontend/src/components/FeatureLock.tsx": "Displays a lock screen for gated features with an upgrade button dispatching a membership navigation event.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Builds a 6‑month bar chart summarizing closed profit and estimated fees from deal data.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog collecting basic user info and submitting it via a profile‑save mutation.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a table of zip codes and corresponding total profit values.",
  "frontend/src/components/SignInScreen.tsx": "Sign‑in UI using Internet Identity with branding and feature highlights.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen showing a failure message and a retry button.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Full‑screen loading view with background art, logo, and spinner.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useBackendActor.ts": "Similar to useActor but with safer admin‑token initialization and exposes error and refetch state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, deals, buyers, contracts, analytics, and membership data via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind base styles and theme variables for light and dark mode.",
  "frontend/src/lib/copy.ts": "Centralized UI text constants for navigation, errors, empty states, locked features, and admin messages.",
  "frontend/src/lib/dealMath.ts": "Implements helper functions for calculating MAO, estimated profit, and assignment fees.",
  "frontend/src/lib/membership.ts": "Contains membership access checks, deal limits, and a generic locked feature message formatter.",
  "frontend/src/lib/money.ts": "Utility functions to format cents to USD strings and parse USD strings back to cents.",
  "frontend/src/main.tsx": "Initializes React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface for viewing catalog, updating membership pricing, and granting membership tiers.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays analytics metrics and profit-by-zip tables for Enterprise users, with locking for lower tiers.",
  "frontend/src/pages/BuyersListPage.tsx": "Lists and manages buyers with create/edit functionality, gated behind Pro or Enterprise access.",
  "frontend/src/pages/ContractsPage.tsx": "Renders the contracts management interface with deal selection, access control, and upload/view components. Handles loading, errors, and empty states for deals.",
  "frontend/src/pages/DashboardPage.tsx": "Displays key deal metrics, a monthly performance chart, and current membership info. Loads user and deal data to populate dashboard stats.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "Provides an AI-powered deal analyzer with address input, analysis results, and the ability to create a new deal from the analysis. Manages form state, API calls, and success/error handling.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Shows all deals organized by stage with creation and editing options, enforcing membership limits for Basic users. Supports loading states and deal editor dialogs.",
  "frontend/src/pages/MembershipPage.tsx": "Displays membership plans, pricing, and features with fallback pricing and upgrade/downgrade actions. Handles catalog loading errors and saving updated user profiles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash routing), persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color tokens, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Maintains project metadata including schema version, features, and pending feature requests for membership pricing updates."
}