{
  "backend/main.mo": "Main backend actor defining membership, user profiles, deals, buyers, contracts, analytics, and Stripe config, including storage mixins and authorization setup.",
  "backend/migration.mo": "Simple migration module that preserves existing actor state by returning the old actor unchanged.",
  "feature_evidence.json": "JSON report listing feature evidence for recent frontend authentication, diagnostics, and profile-loading reliability changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of all significant frontend files describing functionality, styling, and improved auth and diagnostics behavior.",
  "frontend/index.css": "Global Tailwind-based theme variables and styling for light/dark modes and sidebar color system.",
  "frontend/index.html": "Basic HTML entry point mounting the React app with root div and main script.",
  "frontend/src/App.tsx": "Main React app orchestrating startup flow, identity, actor initialization, profile fetching, error handling, and route-specific startup behavior.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Display component showing an access-denied message with optional back navigation.",
  "frontend/src/components/AnalysisResultCard.tsx": "UI card that renders deal analysis details, including ARV, MAO, comps, and rating badge.",
  "frontend/src/components/AppShell.tsx": "Main application shell managing navigation, user logout, and lazy-loaded page rendering, with mobile support and an error boundary.",
  "frontend/src/components/AppShellErrorBoundary.tsx": "Error boundary component that catches render errors in AppShell and displays a fallback UI with reset capability.",
  "frontend/src/components/BuyerCard.tsx": "Displays a buyer’s summary info including contact details, budget, and preferred areas, with an edit trigger.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Dialog for creating, editing, and deleting buyers with form fields and validation tied to query mutations.",
  "frontend/src/components/ContractList.tsx": "Fetches and displays contracts for a deal with status, download support, and error or empty states.",
  "frontend/src/components/ContractUploader.tsx": "Uploader for contract files with type/size validation, progress tracking, and mutation to store the document.",
  "frontend/src/components/DealCard.tsx": "Card showing key deal details like address, ARV, offer, and profit, with an edit button.",
  "frontend/src/components/DealEditorDialog.tsx": "Dialog for creating, editing, and deleting deals with full form state, validation, and mutation handling.",
  "frontend/src/components/FeatureLock.tsx": "Displays a locked-feature card prompting users to upgrade to required membership tiers.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Builds a 6‑month bar chart summarizing closed profit and estimated fees from deal data.",
  "frontend/src/components/OpaqueOverlays.tsx": "Provides opaque wrapper components for dialog, sheet, and select content to override default translucent styles.",
  "frontend/src/components/PageQueryErrorState.tsx": "Shows a standardized error state with retry, secondary actions, and optional contact support.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Onboards new users by initializing their profile and saving basic contact info with error handling.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a simple table listing zip codes with their total profit.",
  "frontend/src/components/SignInScreen.tsx": "Login screen using Internet Identity with branding, sign‑in button, and value propositions.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen component displaying startup failures with diagnostic hints, technical details, and actions to retry or sign out.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Loading screen showing app branding and a spinner with an optional message.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Hook that builds a backend actor with identity and optional admin token handling, exposing readiness and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identities, status flags, and the AuthClient lifecycle.",
  "frontend/src/hooks/useMediaQuery.ts": "Hooks for tracking media query matches, including a helper for detecting mobile screens.",
  "frontend/src/hooks/useQueries.ts": "Collection of react‑query hooks for backend data, including profile fetching with timeout, error normalization, and identity-safe caching.",
  "frontend/src/index.css": "Global Tailwind theme definitions for light and dark modes plus base styling and sidebar component tweaks.",
  "frontend/src/lib/authErrors.ts": "Provides helpers to detect auth, timeout, and network errors and map them to user-friendly messages.",
  "frontend/src/lib/copy.ts": "Defines static UI copy strings for navigation, errors, empty states, locked features, admin text, and support.",
  "frontend/src/lib/dealMath.ts": "Contains simple real estate math utilities for MAO, estimated profit, and assignment fees.",
  "frontend/src/lib/membership.ts": "Implements membership tier access checks and feature lock messaging.",
  "frontend/src/lib/money.ts": "Formats and parses USD values to and from bigint cents.",
  "frontend/src/lib/support.ts": "Holds support email utilities for generating and opening mailto links.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface for managing membership pricing, granting tiers, and configuring Stripe.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays analytics metrics and profit-by-zip data with membership gating and error handling.",
  "frontend/src/pages/BuyersListPage.tsx": "Shows and manages the user's buyers list with create/edit dialogs and membership checks.",
  "frontend/src/pages/ContractsPage.tsx": "Manages contract uploads and listings for selected deals with Enterprise-tier gating and loading/error states.",
  "frontend/src/pages/DashboardPage.tsx": "Displays deal metrics, charts, and user membership info, loading deals and user profile and handling errors.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "Provides AI-driven deal analysis input, displays analysis results, and allows creating a new deal from the analysis.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Shows the deals pipeline grouped by stage, enforces membership limits, and provides deal creation and editing.",
  "frontend/src/pages/MembershipPage.tsx": "Loads membership catalog, displays tier options, and initiates Stripe checkout for upgrades.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation notice with session ID and options to retry or return to the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms membership purchase using the Stripe session, updates user profile, and handles success or error states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL and hash parameters, managing sessionStorage-backed persistence, and extracting the current route path.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theming extensions, colors, fonts, animations, and plugins.",
  "project_state.json": "Project metadata describing current state, known issues, and feature requests related to profile-loading reliability and frontend auth error handling."
}