{
  "backend/main.mo": "Defines the main backend actor with storage mixins, access control, and comprehensive data models for users, deals, buyers, contracts, payments, analytics, and Stripe integration.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs with high‑confidence classifications.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing styling, pages, components, and logic improvements.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light/dark themes plus global background and border utilities.",
  "frontend/index.html": "Basic HTML entrypoint mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Top‑level app managing startup flow, authentication, profile loading, routing, and detailed error classification.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Simple card UI showing an access‑denied message with optional back navigation.",
  "frontend/src/components/AnalysisResultCard.tsx": "Displays detailed deal analysis results including ARV, MAO, comps, and rating with styled badges.",
  "frontend/src/components/AppShell.tsx": "Main application shell managing navigation, lazy-loaded pages, mobile menu, and user logout. It renders different pages based on selected navigation state.",
  "frontend/src/components/AppShellErrorBoundary.tsx": "Error boundary component that displays a fallback UI when page rendering fails and allows resetting.",
  "frontend/src/components/BuyerCard.tsx": "Displays a buyer’s basic details, contact info, preferences, and budget with an edit action.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Dialog for creating, editing, and deleting buyers with form fields and backend mutations.",
  "frontend/src/components/ContractList.tsx": "Lists all contracts for a deal with status badges, error/loading states, and download functionality.",
  "frontend/src/components/ContractUploader.tsx": "Handles file selection, validation, and uploading of contract documents with progress tracking.",
  "frontend/src/components/DealCard.tsx": "Shows a deal’s address, seller, financial metrics, and provides an edit action.",
  "frontend/src/components/DealEditorDialog.tsx": "Dialog for creating and editing deals, managing form state, loading data, and submitting create/update/delete mutations.",
  "frontend/src/components/FeatureLock.tsx": "Displays a locked feature card prompting users to upgrade to a required membership tier.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Generates a bar chart summarizing profit and estimated fees by month for the last six months.",
  "frontend/src/components/OpaqueCard.tsx": "Provides an opaque Card wrapper enforcing solid backgrounds and re-exports card subcomponents.",
  "frontend/src/components/OpaqueOverlays.tsx": "Opaque wrappers for dialog, sheet, and select components to disable transparency and blur effects.",
  "frontend/src/components/PageQueryErrorState.tsx": "Error state UI showing a message with optional retry, secondary actions, and contact support.",
  "frontend/src/components/ProfileSetupDialog.tsx": "First-time profile setup dialog that initializes user permissions and saves basic profile data.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a table listing total profit grouped by zip code.",
  "frontend/src/components/SignInScreen.tsx": "Sign-in screen using Internet Identity with branding, login button, and feature highlights.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays a startup error screen with message, stage info, and expandable technical details, including error classification hints.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Shows a branded loading screen with logo, wordmark, spinner, and optional loading message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, reinitializing and invalidating queries when identity changes.",
  "frontend/src/hooks/useBackendActor.ts": "Builds an authenticated or anonymous backend actor with optional admin token, handling identity initialization and query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity restoration, state management, and AuthClient configuration.",
  "frontend/src/hooks/useMediaQuery.ts": "Implements a hook for media query matching and a helper for mobile detection.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for backend operations, including a startup-safe user profile fetch with timeout and error normalization.",
  "frontend/src/index.css": "Defines Tailwind-based light and dark theme variables and utility classes for consistent UI styling.",
  "frontend/src/lib/authErrors.ts": "Provides utilities to detect auth, timeout, and network errors and return user-friendly messages.",
  "frontend/src/lib/copy.ts": "Centralized text constants for navigation, errors, empty states, locked features, admin UI, and support messages.",
  "frontend/src/lib/dealMath.ts": "Implements MAO, estimated profit, and assignment fee calculations for deals.",
  "frontend/src/lib/membership.ts": "Defines membership-based access rules and helper for generating locked feature messages.",
  "frontend/src/lib/money.ts": "Formats and parses currency values in cents and computes annual savings and monthly equivalents.",
  "frontend/src/lib/support.ts": "Provides support email constant and utilities to build or open mailto links.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface for managing membership pricing, granting tiers, and configuring Stripe.",
  "frontend/src/pages/AnalyticsPage.tsx": "Enterprise-only analytics dashboard showing performance metrics and profit by zip code.",
  "frontend/src/pages/BuyersListPage.tsx": "Pro or Enterprise page for viewing, adding, and editing cash buyers with error and lock handling.",
  "frontend/src/pages/ContractsPage.tsx": "Enterprise-only page for selecting deals and managing contract uploads with loading and error states.",
  "frontend/src/pages/DashboardPage.tsx": "Displays key deal metrics, charts, and membership info using fetched deals and user profile data.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "Provides an AI-powered deal analyzer with form inputs and lets users add analyzed deals to the pipeline.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Shows all deals organized by stage, allows creating and editing deals, and enforces membership limits.",
  "frontend/src/pages/MembershipPage.tsx": "Shows membership tiers, pricing, and starts Stripe checkout sessions for upgrades.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Informs users that a payment was canceled and provides options to retry or return to the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms membership purchase using the session ID, updates the user profile, and provides navigation options.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters and hash routes, and persist or clear parameters in sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and component extensions for the frontend.",
  "project_state.json": "Stores the project’s state, known issues, and feature requirements for fixing profile-loading and authentication flows."
}