{
  "backend/main.mo": "Defines the main backend actor with storage mixins, access control, data models for users, deals, buyers, contracts, payments, analytics, and Stripe configuration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Defines Tailwind base styles and OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point mounting the React app and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Top‑level app component with startup state machine, authentication gating, profile loading, and error handling.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Displays an access‑denied message with optional back navigation using card UI components.",
  "frontend/src/components/AnalysisResultCard.tsx": "Renders deal analysis results including ARV, MAO, comps, and rating with styled UI components.",
  "frontend/src/components/AppShell.tsx": "Top-level layout managing navigation, mobile menu, lazy-loaded pages, and logout behavior based on user profile.",
  "frontend/src/components/AppShellErrorBoundary.tsx": "Error boundary that catches rendering errors and shows a fallback UI with reset handling.",
  "frontend/src/components/BuyerCard.tsx": "Displays a buyer’s key details with edit action, contact info, budget, and preferred areas.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Dialog for creating, updating, and deleting buyers with form fields and query mutations.",
  "frontend/src/components/ContractList.tsx": "Fetches and displays contract documents for a deal with status, errors, and download actions.",
  "frontend/src/components/ContractUploader.tsx": "Handles selecting, validating, and uploading contract files with progress tracking and type selection.",
  "frontend/src/components/DealCard.tsx": "Shows summary info for a deal including address, seller, ARV, offer, and estimated profit with an edit button.",
  "frontend/src/components/DealEditorDialog.tsx": "Dialog for creating, editing, and deleting deals with form fields mapped to backend data and query mutations.",
  "frontend/src/components/FeatureLock.tsx": "Displays a lock screen for gated features with upgrade prompt based on required membership tier.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Builds a 6‑month bar chart summarizing closed profit and estimated fees from deals.",
  "frontend/src/components/OpaqueOverlays.tsx": "Provides wrappers for dialog, sheet, and select content that enforce opaque backgrounds.",
  "frontend/src/components/PageQueryErrorState.tsx": "Generic error state component with retry, secondary actions, and optional contact support button.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Profile setup dialog that collects user info and saves it via a mutation.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a table showing total profit grouped by zip code.",
  "frontend/src/components/SignInScreen.tsx": "Sign‑in screen using Internet Identity with branding and value propositions.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays a startup error UI with diagnostic hints, retry/sign-out actions, and support email generation.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Shows a branded loading screen with a spinner and optional status message during startup.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBackendActor.ts": "Builds a backend actor with optional admin token init, tracks loading/error states, and invalidates dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login state, identity loading, and context management using Dfinity AuthClient.",
  "frontend/src/hooks/useMediaQuery.ts": "React hooks for subscribing to media query changes and detecting mobile layouts.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations including profile fetch with timeouts and error normalization.",
  "frontend/src/index.css": "Tailwind base styles and custom CSS variables defining a dark warm theme with utility enhancements.",
  "frontend/src/lib/authErrors.ts": "Helpers to classify auth, timeout, and network errors and generate user-friendly error messages.",
  "frontend/src/lib/copy.ts": "Defines static UI text strings for navigation, errors, empty states, locked features, admin panel, and support sections.",
  "frontend/src/lib/dealMath.ts": "Provides helper functions to calculate MAO, estimated profit, and assignment fees for deals.",
  "frontend/src/lib/membership.ts": "Contains membership access checks and utility functions for feature gating and deal limits.",
  "frontend/src/lib/money.ts": "Formats and parses USD values between bigint cents and string representations.",
  "frontend/src/lib/support.ts": "Offers support email constants and utilities to generate or open mailto links.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface for editing membership pricing, granting tiers, and configuring Stripe settings with permission checks.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays analytics metrics and profit-by-zip data for Enterprise users with loading and error states.",
  "frontend/src/pages/BuyersListPage.tsx": "Shows and manages the buyer list for Pro/Enterprise users, including adding and editing buyers with error handling.",
  "frontend/src/pages/ContractsPage.tsx": "Enterprise-only contracts manager allowing deal selection, contract uploads, and handling loading or error states.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard displaying deal metrics, charts, and membership info using fetched deals and user profile data.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "AI-powered deal analysis page allowing address input, viewing results, and creating a deal from the analysis.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Pipeline view of deals by stage with permissions, deal creation, and editing via a modal editor.",
  "frontend/src/pages/MembershipPage.tsx": "Membership pricing and upgrade page that loads catalog data and initiates Stripe checkout sessions.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays payment cancellation details with session ID and navigation options back to membership or dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles purchase confirmation using the session ID and updates user membership before showing success actions.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, manage sessionStorage-backed persistence, and retrieve or clear stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, fonts, shadows, and enabling dark mode with animation and typography plugins.",
  "project_state.json": "Project state file defining schema version, known issues, and existing feature requirements for authentication and profile-loading behavior."
}