{
  "backend/main.mo": "Defines the backend actor with membership pricing, user profiles, deals, buyers, contracts, analytics types, and storage state for IDs and maps.",
  "feature_evidence.json": "Lists feature evidence entries linking features to impacted frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short descriptions of all major frontend source files and their responsibilities for build planning.",
  "frontend/index.css": "Tailwind base theme defining light/dark OKLCH color tokens and global background/foreground settings.",
  "frontend/index.html": "HTML root template mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Implements the startup flow with identity, actor, routing, and profile loading stages plus error handling and payment-route support.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI component showing an access-denied message with optional back navigation.",
  "frontend/src/components/AnalysisResultCard.tsx": "Card component displaying deal analysis metrics, rating badge, and comparable sales list.",
  "frontend/src/components/AppShell.tsx": "Main application shell managing navigation, lazy‑loaded pages, mobile menu, and logout handling.",
  "frontend/src/components/AppShellErrorBoundary.tsx": "Error boundary component that displays a fallback UI and allows resetting after errors.",
  "frontend/src/components/BuyerCard.tsx": "Displays a buyer’s summary info including contact details, budget, and preferred areas with an edit button.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Dialog for creating, editing, and deleting buyers with form fields and validation.",
  "frontend/src/components/ContractList.tsx": "Fetches and displays uploaded contracts for a deal with loading, error, and view actions.",
  "frontend/src/components/ContractUploader.tsx": "Uploads contract files with validation, progress tracking, and document type selection.",
  "frontend/src/components/DealCard.tsx": "Compact card showing deal address, seller, ARV, offer, and estimated profit with an edit action.",
  "frontend/src/components/DealEditorDialog.tsx": "Modal form for creating, editing, and deleting deals with full field state management and mutation hooks.",
  "frontend/src/components/FeatureLock.tsx": "Displays a locked-feature card prompting the user to upgrade to a required membership tier.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Builds a 6‑month bar chart summarizing closed profits and estimated fees from deal data.",
  "frontend/src/components/PageQueryErrorState.tsx": "Error display component with retry, secondary action, and optional contact support button.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal for initial user profile setup with name, phone, email, and save‑profile mutation.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a table of total profit grouped by zip code or a fallback message if empty.",
  "frontend/src/components/SignInScreen.tsx": "Branded sign‑in screen using Internet Identity with value props and a login button.",
  "frontend/src/components/StartupErrorScreen.tsx": "Startup‑failure UI showing an error message with retry and contact‑support actions.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Splash loading screen with branding and a spinner shown during app startup.",
  "frontend/src/hooks/useActor.ts": "Creates a backend actor tied to the user's Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Builds a backend actor with improved initialization, optional admin token setup, and readiness state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and identity lifecycle management.",
  "frontend/src/hooks/useMediaQuery.ts": "Offers a media query hook that tracks match state and a convenience hook for mobile detection.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for profiles, admin checks, and domain features with normalized errors.",
  "frontend/src/index.css": "Defines Tailwind layers and a dark theme color system using CSS variables for the app UI.",
  "frontend/src/lib/copy.ts": "Centralized UI text and error messages for navigation, errors, empty states, and admin sections.",
  "frontend/src/lib/dealMath.ts": "Provides helper functions for MAO, estimated profit, and assignment fee calculations.",
  "frontend/src/lib/membership.ts": "Contains membership tier access rules and utilities for feature gating and deal limits.",
  "frontend/src/lib/money.ts": "Formats and parses USD amounts between bigint cents and display strings.",
  "frontend/src/lib/support.ts": "Utilities for generating support email links and triggering mailto actions.",
  "frontend/src/main.tsx": "Application entry point setting up React Query, Internet Identity provider, and rendering the main app.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin dashboard for managing membership pricing, granting tiers, and configuring Stripe settings with form-bound state.",
  "frontend/src/pages/AnalyticsPage.tsx": "Enterprise-only analytics view showing key metrics and profit-by-zip with loading and error handling.",
  "frontend/src/pages/BuyersListPage.tsx": "Pro/Enterprise page for viewing, creating, and editing buyers, including gated access and editor dialog controls.",
  "frontend/src/pages/ContractsPage.tsx": "Enterprise-only contracts manager allowing deal selection and uploading/listing documents with detailed error states.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard showing deal metrics, charts, and membership info with error and loading handling.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "AI-driven deal analyzer that processes an address, displays analysis, and lets users add the result to the pipeline.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Renders the deals pipeline UI, loads deals and user profile, enforces membership limits, and manages deal creation/edit dialogs.",
  "frontend/src/pages/MembershipPage.tsx": "Displays membership tiers with pricing and features, toggles annual/monthly billing, and creates Stripe checkout sessions for upgrades.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment canceled message, extracts the session ID, and provides navigation back to membership or the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Handles payment success by confirming the membership purchase, updating the profile, and showing status or error states.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme colors, fonts, shadows, and content paths with extended design tokens and plugins.",
  "project_state.json": "Defines the project's current state, including known startup issues and four existing features focused on fixing app launch reliability, profile loading, error reporting, and payment-result routing."
}