{
  "backend/main.mo": "Defines the main backend actor with authorization, blob storage, membership catalog, user profiles, deals, buyers, contracts, and various data models.",
  "backend/migration.mo": "Migration module converting old actor state to the new format by adding a default membership catalog.",
  "feature_evidence.json": "Lists feature evidence linking frontend files to two membership-related feature IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files for reference or build tooling.",
  "frontend/index.css": "Tailwind CSS base file defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app handling authentication, backend actor initialization, profile loading, and lazy-loading the AppShell.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI screen showing an access denied message with optional back navigation.",
  "frontend/src/components/AnalysisResultCard.tsx": "Card component displaying deal analysis metrics, rating badge, and comparable sales.",
  "frontend/src/components/AppShell.tsx": "Main layout component that manages navigation, lazy‑loaded pages, sidebar state, and logout handling.",
  "frontend/src/components/BuyerCard.tsx": "Displays a compact buyer summary card with contact info, budget, and edit action.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Modal form for creating, editing, and deleting buyers using query hooks and validation.",
  "frontend/src/components/ContractList.tsx": "Loads and displays uploaded contracts for a deal with options to view each file.",
  "frontend/src/components/ContractUploader.tsx": "Handles contract file selection, validation, upload progress, and submission for a deal.",
  "frontend/src/components/DealCard.tsx": "Displays a deal summary card including seller info, ARV, offer, and estimated profit with an edit button.",
  "frontend/src/components/DealEditorDialog.tsx": "Modal form for creating, updating, and deleting deals including stage, financials, and buyer assignment.",
  "frontend/src/components/FeatureLock.tsx": "Displays a locked-feature card explaining required membership tier and triggers a membership navigation event.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Builds a 6‑month bar chart summarizing deal profits and estimated fees using Recharts.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog collecting basic user profile info and submitting it via useSaveCallerUserProfile.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a table showing total profit grouped by zip code.",
  "frontend/src/components/SignInScreen.tsx": "Full-page sign-in UI using Internet Identity with branding and value props.",
  "frontend/src/components/StartupErrorScreen.tsx": "Error screen showing a message and retry button when startup fails.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Splash/loading screen with branding and animated spinner during app initialization.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useBackendActor.ts": "Provides a backend actor with optional admin token initialization and basic error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, state, and persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, deals, buyers, analytics, and membership data through the backend actor.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/lib/copy.ts": "Centralized text constants for navigation labels, errors, empty states, and admin UI copy.",
  "frontend/src/lib/dealMath.ts": "Utility functions for calculating MAO, estimated profit, and assignment fees.",
  "frontend/src/lib/membership.ts": "Helpers for checking membership feature access and limits and generating lock messages.",
  "frontend/src/lib/money.ts": "Functions to format cents to USD strings and parse USD strings back to cents.",
  "frontend/src/main.tsx": "App entry point wiring React, Internet Identity provider, and React Query client.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface for editing membership pricing and granting tiers to users.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays advanced analytics metrics and profit tables for Enterprise users.",
  "frontend/src/pages/BuyersListPage.tsx": "Manages buyer list display and editing with membership-gated access.",
  "frontend/src/pages/ContractsPage.tsx": "Contracts management page allowing Enterprise users to select deals and upload or view documents.",
  "frontend/src/pages/DashboardPage.tsx": "Renders the dashboard, fetching deals and user profile to compute key metrics and display a performance chart and membership info.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "Provides an AI-powered deal analyzer with address input, shows analysis results, and allows creating a deal from the analysis.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Displays the deal pipeline organized by stages, enforces membership limits, and supports creating and editing deals.",
  "frontend/src/pages/MembershipPage.tsx": "Shows membership plans with pricing and features, loads pricing catalog, and allows switching the user’s membership tier.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Defines project state, existing membership-related features, and pending admin and backend feature requests for managing membership catalogs and tiers."
}