{
  "backend/main.mo": "Defines the backend actor with storage mixins, access control, payment config, and data models for users, membership, deals, buyers, contracts, analytics, and Stripe integration.",
  "feature_evidence.json": "Feature evidence report listing updated sidebar navigation styling and related frontend files, components, and test metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of multiple frontend components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind-based OKLCH color tokens for light and dark modes, including sidebar‑specific variables.",
  "frontend/index.html": "Basic HTML wrapper loading the root React app via main.tsx.",
  "frontend/src/App.tsx": "Main app controller managing identity, backend actor readiness, profile loading, routing, and startup error handling.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI card displaying an access‑denied message with an optional back button.",
  "frontend/src/components/AnalysisResultCard.tsx": "Card component rendering detailed deal analysis data including ARV, MAO, comps, and rating badge.",
  "frontend/src/components/AppShell.tsx": "Main application shell managing navigation, page rendering, mobile menu behavior, and logout, with lazy‑loaded pages.",
  "frontend/src/components/AppShellErrorBoundary.tsx": "Error boundary component that catches rendering errors and displays a fallback UI with reset handling.",
  "frontend/src/components/BuyerCard.tsx": "Displays a buyer’s summary info including contact, budget, and preferred areas with an edit button.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Dialog for creating, editing, and deleting buyers, including form state management and backend mutations.",
  "frontend/src/components/ContractList.tsx": "Lists contracts for a deal with loading, error, empty states, status badges, and download actions.",
  "frontend/src/components/ContractUploader.tsx": "Form to upload contract files with validation, progress tracking, and backend upload integration.",
  "frontend/src/components/DealCard.tsx": "Shows a deal summary with address, seller, ARV, offer, and estimated profit plus an edit option.",
  "frontend/src/components/DealEditorDialog.tsx": "Dialog component for creating, editing, and deleting deals with fields for seller info, pricing, stage, buyer assignment, and profit values.",
  "frontend/src/components/FeatureLock.tsx": "Displays a locked-feature card prompting users to upgrade their membership tier.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Renders a bar chart summarizing the last six months of profit and estimated fees based on deal data.",
  "frontend/src/components/OpaqueOverlays.tsx": "Provides wrapper components that enforce opaque backgrounds for dialog, sheet, and select content.",
  "frontend/src/components/PageQueryErrorState.tsx": "Shows an error state for failed page queries with retry and optional support/contact actions.",
  "frontend/src/components/ProfileSetupDialog.tsx": "First‑time user profile setup dialog that initializes permissions and saves basic profile info.",
  "frontend/src/components/ProfitByZipTable.tsx": "Table displaying total profit aggregated by zip code.",
  "frontend/src/components/SignInScreen.tsx": "Sign‑in screen using Internet Identity with branding and value‑prop sections.",
  "frontend/src/components/StartupErrorScreen.tsx": "Displays a startup error with stage info, diagnostic hints, retry, sign-out, and contact-support actions.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Shows a branded loading screen with spinner and optional message during app startup.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Builds a backend actor with identity-awareness, optional admin initialization, and exposes loading and error states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and persisted identities via a React context provider.",
  "frontend/src/hooks/useMediaQuery.ts": "Provides a hook for media‑query matching and a helper for mobile detection.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend data, including profile loading with timeouts and normalized error handling.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark themes, component styling, and custom sidebar and chart color variables.",
  "frontend/src/lib/authErrors.ts": "Provides helpers to classify auth, timeout, and network errors and generate user-friendly messages.",
  "frontend/src/lib/copy.ts": "Defines centralized UI copy for navigation labels, error messages, empty states, locked features, admin text, and support text.",
  "frontend/src/lib/dealMath.ts": "Implements MAO, estimated profit, and assignment fee calculations for deals.",
  "frontend/src/lib/membership.ts": "Contains membership tier access checks and utilities including deal limits and locked-feature messaging.",
  "frontend/src/lib/money.ts": "Formats bigint cents to USD strings and parses USD strings back into bigint cents.",
  "frontend/src/lib/support.ts": "Provides support email constant and functions to open or generate mailto support links.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app in the Internet Identity provider.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin interface for managing membership pricing, granting tiers, and configuring Stripe settings.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays enterprise-only analytics with metrics, error handling, and a profit-by-zip table.",
  "frontend/src/pages/BuyersListPage.tsx": "Shows and manages the buyer list with Pro/Enterprise gating, loading states, error handling, and buyer editing dialogs.",
  "frontend/src/pages/ContractsPage.tsx": "Enterprise-only contracts manager allowing users to select deals, upload contracts, and view contract lists with robust error states.",
  "frontend/src/pages/DashboardPage.tsx": "Displays deal metrics, charts, and membership info using fetched deals and user profile, with loading and error handling.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "Provides an AI-powered deal analyzer with form input, analysis results, and the ability to create a new deal from the analysis.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Shows all deals organized by stage, supports creating/editing deals, and enforces membership limits on active deals.",
  "frontend/src/pages/MembershipPage.tsx": "Displays membership tiers, pricing options, and triggers Stripe checkout sessions for upgrades.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Informs users of canceled payments, shows session details, and provides navigation back to membership or dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Validates a successful payment session, confirms membership activation, and offers navigation to dashboard or membership plans.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash routing), store them in sessionStorage, and clear stored or hash-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and theme extensions, plus plugin integration.",
  "project_state.json": "Defines the project’s state metadata, existing features, pending feature requests, and configuration info."
}