{
  "backend/main.mo": "Defines actor with storage mixins, access control, and data models for users, deals, buyers, contracts, analytics, plus helper functions and ID counters.",
  "feature_evidence.json": "Lists feature evidence records mapping feature IDs to related files, components, tests, and confidence.",
  "frontend-file-summaries.txt": "Provides short human-written summaries of all frontend source files for reference.",
  "frontend/index.css": "Tailwind-based global CSS defining light/dark OKLCH color variables and base styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root app component controlling auth flow, startup loading, theme setup, and profile-gated access to the main shell.",
  "frontend/src/components/AnalysisResultCard.tsx": "Card UI component displaying deal analysis details, MAO calculation, ratings, and comparable sales.",
  "frontend/src/components/AppShell.tsx": "Main layout with sidebar navigation, logout handling, and page routing for the authenticated experience.",
  "frontend/src/components/BuyerCard.tsx": "Displays buyer info in a card with contact details, budget, preferred areas, and an edit button.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Dialog for creating, editing, or deleting a buyer with form fields and mutation handling.",
  "frontend/src/components/ContractList.tsx": "Fetches and displays a list of uploaded contracts for a deal with file viewing support.",
  "frontend/src/components/ContractUploader.tsx": "Allows file selection and upload of contract documents with validation and upload progress tracking.",
  "frontend/src/components/DealCard.tsx": "Shows key deal information including address, seller, ARV, offer, and estimated profit with edit action.",
  "frontend/src/components/DealEditorDialog.tsx": "Dialog for creating or editing a deal, including stage, financials, buyer assignment, and delete option.",
  "frontend/src/components/FeatureLock.tsx": "UI card indicating a feature is locked behind a higher membership tier with upgrade button.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Generates a bar chart summarizing recent monthly profits and estimated fees from deals.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal form for entering and saving a user profile with name, phone, email, and membership tier.",
  "frontend/src/components/ProfitByZipTable.tsx": "Displays a table of zip codes and corresponding profit totals, or a message if empty.",
  "frontend/src/components/SignInScreen.tsx": "Login screen using Internet Identity with branding, a sign‑in button, and value props.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Full‑screen loading indicator showing a spinner and message.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity loading, and state flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, deals, buyers, documents, analytics, and related data via the actor.",
  "frontend/src/index.css": "Tailwind CSS base setup defining color variables and dark mode themes.",
  "frontend/src/lib/copy.ts": "Centralized text constants for navigation labels, errors, empty states, and feature lock messages.",
  "frontend/src/lib/dealMath.ts": "Utility functions for MAO, estimated profit, and assignment fee calculations.",
  "frontend/src/lib/membership.ts": "Defines membership-based access checks and limits plus a helper for locked feature messages.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AnalyticsPage.tsx": "Displays enterprise-only analytics metrics and a profit-by-zip table with loading and no‑data states.",
  "frontend/src/pages/BuyersListPage.tsx": "Shows and manages the buyers list for Pro+ users with editor dialogs and loading handling.",
  "frontend/src/pages/ContractsPage.tsx": "Enterprise-only contracts manager allowing deal selection, uploads, and contract listing.",
  "frontend/src/pages/DashboardPage.tsx": "Renders deal metrics, charts, and membership info summarizing overall pipeline performance.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "Provides AI deal analysis input, displays results, and enables creating a deal from the analysis.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Shows deals by stage with add/edit support and enforces Basic plan active-deal limits.",
  "frontend/src/pages/MembershipPage.tsx": "Renders membership plan cards and allows users to switch tiers using profile update mutations with toast feedback.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL or session-based parameters, including hash parsing.",
  "frontend/tailwind.config.js": "Defines Tailwind styling configuration with custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata including features, state version, and pending requests for the WholesaleAI project."
}