{
  "backend/main.mo": "Defines backend actor with storage, authorization mixins, Stripe config, and data models for users, deals, buyers, contracts, analytics, and payments.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, including pages, components, hooks, and UI behavior.",
  "frontend/index.css": "Tailwind base layer defining global OKLCH color variables, dark theme overrides, and shared background/foreground styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main app controller handling identity, backend actor readiness, profile fetch, startup timeouts, and routing for payment result pages.",
  "frontend/src/components/AccessDeniedScreen.tsx": "UI card displaying an access denied message with optional back button.",
  "frontend/src/components/AnalysisResultCard.tsx": "Card component that displays deal analysis details including ARV, MAO, comps, and rating badge.",
  "frontend/src/components/AppShell.tsx": "Main app layout with sidebar navigation, lazy‑loaded pages, and session handling.",
  "frontend/src/components/BuyerCard.tsx": "Displays buyer info, contact details, budget, and areas with an edit button.",
  "frontend/src/components/BuyerEditorDialog.tsx": "Modal form for creating, updating, and deleting buyers with validation and API mutations.",
  "frontend/src/components/ContractList.tsx": "Fetches and displays deal contracts with loading, error states, and view actions.",
  "frontend/src/components/ContractUploader.tsx": "Handles selecting, validating, and uploading contract files with progress tracking.",
  "frontend/src/components/DealCard.tsx": "Shows key deal details including address, seller, ARV, offer, and estimated profit.",
  "frontend/src/components/DealEditorDialog.tsx": "Modal form for creating, editing, and deleting deals with stage selection and buyer assignment.",
  "frontend/src/components/FeatureLock.tsx": "Displays a lock screen for restricted features, showing required tier and providing an upgrade button.",
  "frontend/src/components/MonthlyPerformanceChart.tsx": "Generates a 6‑month bar chart summarizing profit and fees from deals using Recharts.",
  "frontend/src/components/PageQueryErrorState.tsx": "Shows a data‑loading error message with retry, optional secondary action, and contact‑support button.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Provides a required onboarding dialog for entering and saving user profile info.",
  "frontend/src/components/ProfitByZipTable.tsx": "Renders a table listing profit totals grouped by zip code.",
  "frontend/src/components/SignInScreen.tsx": "Displays the main sign‑in UI using Internet Identity with branding and value props.",
  "frontend/src/components/StartupErrorScreen.tsx": "Shows a fatal startup error UI with retry and contact‑support options.",
  "frontend/src/components/StartupLoadingScreen.tsx": "Shows a branded full‑screen loading screen with optional message.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBackendActor.ts": "Similar to useActor but waits for identity initialization, conditionally initializes admin access, and exposes readiness states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login state and stored identities.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations such as profiles, deals, admin checks, membership, payments, and error normalization.",
  "frontend/src/index.css": "Configures Tailwind CSS and defines a dark theme with custom color variables and base styles.",
  "frontend/src/lib/copy.ts": "Contains UI copy strings for navigation, errors, empty states, locked features, admin pages, and support.",
  "frontend/src/lib/dealMath.ts": "Implements basic deal‑analysis math functions like MAO, estimated profit, and assignment fees.",
  "frontend/src/lib/membership.ts": "Provides helpers for checking membership‑tier access and limits, plus a function for generating locked‑feature messages.",
  "frontend/src/lib/money.ts": "Formats and parses USD amounts to and from cents stored as bigint.",
  "frontend/src/lib/support.ts": "Provides support email constants and helpers for generating or opening mailto links.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and renders the root component.",
  "frontend/src/pages/AdminPanelPage.tsx": "Admin UI for managing membership pricing, assigning tiers, and configuring Stripe settings, gated by admin checks.",
  "frontend/src/pages/AnalyticsPage.tsx": "Shows analytics metrics and profit‑by‑zip data, enforcing Enterprise‑tier access and handling loading and error states.",
  "frontend/src/pages/BuyersListPage.tsx": "Displays and manages the buyer list with membership gating, loading/error states, and a dialog for creating or editing buyers.",
  "frontend/src/pages/ContractsPage.tsx": "Provides contract upload and management tied to selected deals, gated to Enterprise users with full loading and error handling.",
  "frontend/src/pages/DashboardPage.tsx": "Shows deal metrics, charts, and membership info based on fetched deals, with loading and error fallback states.",
  "frontend/src/pages/DealAnalyzerPage.tsx": "Runs AI deal analysis from an address and lets users create a new deal from the results with validation and status handling.",
  "frontend/src/pages/DealsPipelinePage.tsx": "Manages deals grouped by stages with membership limits, providing creation/editing dialogs and robust loading/error handling.",
  "frontend/src/pages/MembershipPage.tsx": "Displays membership tiers and pricing, allowing users to start a Stripe checkout session for upgrades with loading and error handling.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Displays a payment cancellation message, shows optional session ID, and provides buttons to retry or return to the dashboard.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Confirms a successful payment by validating the session ID, updating the user profile, and handling loading or error states with navigation options.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and clearing them from URL or storage.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended color themes, fonts, shadows, and includes animation and typography plugins.",
  "project_state.json": "Defines the project's state, known issues, requested fixes, and feature requirements for improving reliability and adding contact options."
}