{
  "kind": "build_request",
  "title": "Fix sidebar navigation getting stuck and resolve usability-breaking UI errors",
  "projectName": "Wholesale Lens",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-5",
      "text": "Fix the authenticated app navigation so that clicking a sidebar item reliably switches the main content view (the selected page must render in the main content area and not appear “stuck” in the sidebar).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "It gets stuck on the side bar when you click it the tab should be popped up"
        ]
      },
      "acceptanceCriteria": [
        "From the authenticated shell, clicking each navigation item (Dashboard, Deal Analyzer, Deals Pipeline, Buyers List, Contracts, Analytics, Membership, Admin Panel) updates the active state in the sidebar and renders the correct page in the main content area.",
        "The main content area remains visible and usable after navigation (not overlapped/hidden by the sidebar).",
        "Navigation continues to work after repeated switching between multiple pages without requiring a refresh."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Make the sidebar layout responsive and usable on smaller screens by ensuring the navigation can be opened/closed and that selecting a nav item reveals the content panel (e.g., a collapsible sidebar/drawer behavior on mobile widths).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "It gets stuck on the side bar when you click it the tab should be popped up"
        ]
      },
      "acceptanceCriteria": [
        "On small screens, the navigation can be toggled open and closed, and the main content remains accessible.",
        "When a user selects a navigation item on small screens, the navigation closes (or otherwise gets out of the way) and the chosen page content is visible.",
        "The desktop layout keeps a persistent sidebar and does not regress."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Resolve any runtime/UI errors that prevent normal use of the authenticated app shell (including errors triggered by page switching) and ensure there are no blocking console errors during basic navigation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "fix all your errors make it usable"
        ]
      },
      "acceptanceCriteria": [
        "Basic authenticated flow works end-to-end: sign in, land in the app shell, switch pages from the navigation, and interact with scrollable content without crashes.",
        "No navigation action results in a blank main pane due to an unhandled exception.",
        "Any existing navigation-related console errors (errors thrown during render, click handlers, or lazy loading of pages) are eliminated or handled with a user-facing fallback state."
      ]
    }
  ],
  "constraints": [
    "Do not edit files in frontend immutablePaths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new product features beyond fixing navigation/usability.",
    "Changing backend data models or adding new backend endpoints unless strictly necessary to fix the sidebar navigation issue."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}