{
  "kind": "build_request",
  "title": "Fix startup authentication error during profile loading",
  "projectName": "Wholesale Lens",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Prevent the app from attempting to load the caller profile when the user is not authenticated (so signed-out users see the SignInScreen instead of a startup error). Update the profile query gating so useGetCallerUserProfile only runs when an authenticated Internet Identity is present (not just when an anonymous actor is ready).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Unable to Start\nAuthentication error. Please sign out and sign in again.\n\nFailed at: Profile loading\n\nThere was an authentication problem. Try signing out and signing in again."
        ]
      },
      "acceptanceCriteria": [
        "When the user is signed out (identity is undefined), the app does not call getCallerUserProfile and does not show the 'Unable to Start' error screen for profile loading; it shows SignInScreen.",
        "After signing in, the profile query runs and the app proceeds to AppShell or ProfileSetupDialog (or shows an error only if the authenticated profile fetch genuinely fails)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a clear recovery path on the startup error screen for authentication-related profile loading failures: show a \"Sign Out\" action that clears Internet Identity state and returns the user to the sign-in screen. Use English for all user-facing text.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Authentication error. Please sign out and sign in again.",
          "There was an authentication problem. Try signing out and signing in again."
        ]
      },
      "acceptanceCriteria": [
        "If startup fails at 'Profile loading' with an authentication-related error, the error UI includes a \"Sign Out\" button in addition to retry/support.",
        "Clicking \"Sign Out\" clears the Internet Identity session (calls the existing clear/logout flow) and the app returns to SignInScreen without requiring a manual refresh."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Normalize authentication-related errors from the profile fetch path so they are consistently detected and presented as an authentication issue (ensuring the startup stage shows 'Failed at: Profile loading' with the authentication guidance, and not a generic 'Failed to load profile' message).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Failed at: Profile loading",
          "Authentication error. Please sign out and sign in again."
        ]
      },
      "acceptanceCriteria": [
        "Authentication failures originating from getCallerUserProfile (e.g., backend traps containing \"Unauthorized\" / \"Authentication required\") are mapped to a consistent error message that triggers the authentication recovery UI.",
        "Non-auth failures (timeouts, network errors) continue to show their appropriate messages and do not display the sign-out CTA unless the error is authentication-related."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (read-only UI library components).",
    "Do not modify immutable identity/actor hook files listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts and frontend/src/hooks/useActor.ts)."
  ],
  "nonGoals": [
    "Implementing a new authentication provider (only Internet Identity is used).",
    "Changing backend authorization rules or access-control policy in the canister (unless strictly required to fix the reported startup issue)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}