{
  "kind": "build_request",
  "title": "Fix profile loading failure after Internet Identity login",
  "projectName": "Wholesale Lens",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the post-login startup flow so an authenticated user never gets stuck on the \"Failed to load your profile\" error screen; instead, the app must deterministically do one of: (a) show ProfileSetupDialog for first-time users (no saved profile yet), or (b) load the existing profile and render AppShell.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User: \"Failed to load your profile. Please try again.\n\nFailed at: Profile loading\n\nAn unexpected error occurred. Please try again or contact support if the issue persists.\"",
          "User message: \"Still doesn't work\""
        ]
      },
      "acceptanceCriteria": [
        "After signing in with Internet Identity, the app reaches either ProfileSetupDialog (if no profile exists) or AppShell (if a profile exists) without showing the startup error screen.",
        "If the backend returns null for getCallerUserProfile(), the UI shows ProfileSetupDialog rather than a generic startup error.",
        "If the backend call fails due to auth/session issues, the app performs sign-out recovery (clear identity + React Query cache) and returns the user to the sign-in screen without an infinite loop."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve authentication/session error detection and handling during profile loading so real delegation/identity failures are classified as auth errors and trigger sign-out recovery, while first-time-user cases are not misclassified as auth failures.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "User: \"Failed to load your profile. Please try again.\"",
          "User: \"Still doesn't work\""
        ]
      },
      "acceptanceCriteria": [
        "Profile-loading failures caused by expired/invalid delegations, anonymous caller, 401/403-style failures, or equivalent agent errors are recognized as auth errors and trigger automatic sign-out recovery.",
        "First-time users (no profile yet) do not trigger sign-out recovery; they are routed into ProfileSetupDialog.",
        "The startup error UI is only shown for non-auth failures (network/timeout/unexpected) after classification."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add actionable diagnostics for profile-loading failures: ensure the error displayed in StartupErrorScreen includes a user-friendly message, and the Technical Details section contains the original error message (sanitized) plus a short hint indicating whether the failure was network/timeout/auth/unexpected.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "An unexpected error occurred. Please try again or contact support if the issue persists."
        ]
      },
      "acceptanceCriteria": [
        "When profile loading fails, the error screen shows a clear English message appropriate to the classified error type (network/timeout/unexpected).",
        "The Technical Details accordion shows sanitized underlying error information sufficient to debug (e.g., the raw agent/canister error message) without exposing long secrets/tokens.",
        "The Retry button results in a real re-attempt to fetch the profile (clearing any stale cached profile result for the current principal first)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Harden the backend profile APIs used at startup so they do not trap for normal first-time-user scenarios and provide a reliable way to distinguish \"no profile yet\" from true authorization failures.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Failed at: Profile loading"
        ]
      },
      "acceptanceCriteria": [
        "The backend provides a startup-safe path where an authenticated caller with no existing profile can be identified without triggering an authorization trap.",
        "If any backend method used by the startup/profile-loading flow can trap today under normal conditions, it is adjusted so first-time users are handled gracefully (returning a non-trapping result that allows the frontend to proceed to onboarding)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only Shadcn components).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts / .tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a state upgrade is required."
  ],
  "nonGoals": [
    "Adding new product features unrelated to login/profile startup.",
    "Integrating third-party auth providers (only Internet Identity is supported).",
    "Introducing external databases or non-Motoko backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}