{
  "kind": "build_request",
  "title": "Fill sidebar navigation boxes with solid color styling",
  "projectName": "Wholesale Lens",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the sidebar navigation item “boxes” (all sidebar buttons/links such as Dashboard, Contracts, Admin Panel, Contact Support, Sign Out) so they render as clearly filled-in, solid-color buttons with improved visual polish (stronger background fill, clear borders, and consistent hover/active states) in both light and dark mode, on both desktop sidebar and the mobile sidebar sheet.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "Make those side b ar boxes filled in with color make it look nice"
        ]
      },
      "acceptanceCriteria": [
        "All sidebar navigation buttons have a visibly solid (non-transparent) background fill in light mode and dark mode; underlying page content is not visible through them.",
        "Default, hover, focus, and active states are visually distinct and consistent across all sidebar buttons (including Admin Panel, Contact Support, and Sign Out).",
        "The same filled-in styling applies in the mobile sidebar (Sheet) as well as the desktop sidebar.",
        "No changes are made to any immutable frontend paths (e.g., frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*)."
      ]
    }
  ],
  "constraints": [
    "Frontend changes must respect immutable paths listed in SYSTEM_CONTEXT (do not edit frontend/src/components/ui/* and the immutable hook/main files).",
    "Backend (Motoko) logic and state must not be modified for this styling-only request."
  ],
  "nonGoals": [
    "Adding new navigation routes/pages or changing the sidebar information architecture.",
    "Changing authentication, membership gating, or backend authorization logic.",
    "Generating new images or logos for the sidebar."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}