{
  "kind": "build_request",
  "title": "Lower membership prices and use monthly pricing across plans",
  "projectName": "Deal Memberships",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the backend default membership catalog pricing to be significantly lower than the current defaults, using these new values (in cents): Basic monthly=499, annual=4999; Pro monthly=1499, annual=14999; Enterprise monthly=3999, annual=39999. Keep sale fields disabled by default (isOnSale=false, salePriceCents=null) and update lastUpdated accordingly.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the prices to memberships way lower thanks monthly is fine I think"
        ]
      },
      "acceptanceCriteria": [
        "A fresh canister install initializes membershipCatalog with Basic $4.99/mo ($49.99/yr), Pro $14.99/mo ($149.99/yr), Enterprise $39.99/mo ($399.99/yr).",
        "Sale pricing remains disabled by default for all tiers (isOnSale=false, salePriceCents=null)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure existing deployments also get the new lower defaults on upgrade by adding upgrade logic that conditionally rewrites the stored membershipCatalog only when it still matches the previous default values (Basic 2999/29999, Pro 8999/89999, Enterprise 29999/299999). Do not overwrite pricing if an admin has already customized it.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the prices to memberships way lower thanks monthly is fine I think"
        ]
      },
      "acceptanceCriteria": [
        "After upgrade, if (and only if) the stored catalog matches the previous default prices, the catalog is updated to the new lower defaults.",
        "After upgrade, if the stored catalog differs from the previous defaults (indicating admin customization), the catalog remains unchanged."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend membership pricing fallbacks to match the new backend defaults so the UI shows the new lower prices whenever catalog loading fails (update FALLBACK_PRICING in MembershipPage).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Change the prices to memberships way lower thanks monthly is fine I think"
        ]
      },
      "acceptanceCriteria": [
        "When membership catalog fetch fails, the Membership page displays Basic $4.99/month, Pro $14.99/month, Enterprise $39.99/month using fallback pricing."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the Membership page to show monthly pricing for all plans (including Enterprise) so the displayed period is always per month.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "monthly is fine I think"
        ]
      },
      "acceptanceCriteria": [
        "Enterprise plan card shows pricing with period label \"/ month\" (not \"/ year\").",
        "Basic and Pro plan cards continue to show pricing with period label \"/ month\"."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or other frontend immutablePaths listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Implementing real payment processing or checkout flows.",
    "Adding new membership tiers or changing feature gating rules."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}