{
  "kind": "build_request",
  "title": "Fix profile load failure and add Contact Us email link for launch readiness",
  "projectName": "Wholesale Lens",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the startup error \"Failed to load your profile. This may be a temporary issue.\" by ensuring authenticated users can successfully fetch (and if needed initialize) their caller profile on first login, including brand-new users who have no existing profile yet.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "I'm getting this error Failed to load your profile. This may be a temporary issue."
        ]
      },
      "acceptanceCriteria": [
        "After signing in with Internet Identity, the app does not show the StartupErrorScreen for profile loading under normal conditions.",
        "For a brand-new user (no profile yet), the app reaches the main shell and displays the profile setup dialog (instead of failing with a profile-load error).",
        "If access control initialization/permissions are the root cause, the backend must no longer trap/throw in a way that prevents first-time users from calling getCallerUserProfile / saving their profile.",
        "Retry from the error screen successfully recovers when the underlying issue is transient (e.g., temporary network failure)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a visible \"Contact Us\" option in the authenticated app UI that opens the user’s email client to email wholesalensrealestate@gmail.com (e.g., via a mailto: link).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "can I get a contact us with my email wholesalensrealestate@gmail.com"
        ]
      },
      "acceptanceCriteria": [
        "A \"Contact Us\" action is accessible from the main authenticated UI (e.g., in the sidebar/footer area).",
        "Clicking \"Contact Us\" opens a new email draft addressed to wholesalensrealestate@gmail.com using a mailto link.",
        "User-facing text is in English and matches the app’s existing styling."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Improve launch reliability by adding user-facing recovery paths when critical startup queries fail (actor initialization and profile fetch), including a support pathway that points users to the new Contact Us email when startup errors persist.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ],
        "quotes": [
          "make sure everything loads make this launch able this time so it can go live"
        ]
      },
      "acceptanceCriteria": [
        "Startup error screens provide a clear Retry action (existing) and also provide an obvious way to contact support (wholesalensrealestate@gmail.com) when issues persist.",
        "No infinite loading state occurs during startup; the user either proceeds into the app, sees profile setup, or gets a recoverable error screen with Retry and Contact Us."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Apply a cohesive, launch-ready visual theme polish across the authenticated shell and startup screens (typography, spacing, and a warm real-estate/ledger feel), keeping the current branding and avoiding introducing new product features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-4"
        ]
      },
      "acceptanceCriteria": [
        "Visual styling updates are consistent across the sidebar, primary buttons, and startup screens.",
        "Theme uses a coherent palette and typography treatment (do not introduce blue/purple as primary styling unless already present).",
        "No functional behavior changes are introduced beyond UI polish."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Adding third-party customer support tools (chat widgets, ticketing systems).",
    "Adding email sending from the backend (Contact Us should open the user’s email client via mailto).",
    "Implementing new payment features or changing membership pricing beyond what is required to fix profile loading."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}