{
  "kind": "build_request",
  "title": "Fix infinite 'Loading your profile' startup state",
  "projectName": "Wholesale Lens",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Eliminate the infinite startup loading state when fetching the signed-in user's profile so the app always transitions to one of: AppShell, ProfileSetupDialog, or StartupErrorScreen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Nope still stuck on loading profile"
        ]
      },
      "acceptanceCriteria": [
        "After signing in, the app does not remain on the \"Loading your profile...\" screen indefinitely.",
        "Within a bounded time (e.g., <= 30 seconds), the app transitions to either: the main app shell, the profile setup dialog (when profile is missing/empty), or an error screen with a working Retry button.",
        "Retry from the error screen re-attempts the profile fetch without requiring a full page refresh."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a hard timeout to the profile fetch request used by useGetCallerUserProfile (React Query) so that a hung canister/agent call results in a surfaced error instead of a permanent loading state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Nope still stuck on loading profile"
        ]
      },
      "acceptanceCriteria": [
        "If getCallerUserProfile does not resolve within the configured timeout window, the query transitions to an error state (not loading).",
        "The error message shown to the user is in English and indicates the profile could not be loaded and they should retry.",
        "The timeout behavior does not break the normal case where profiles load successfully."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the startup gating logic in frontend/src/App.tsx so that the UI does not block forever on profileLoading; if the profile query is not loading but is also not fetched due to being disabled, cancelled, or errored, the user should see an actionable error state rather than a loading spinner.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Nope still stuck on loading profile"
        ]
      },
      "acceptanceCriteria": [
        "If the profile query is disabled/not running (e.g., actor not ready) the app shows the appropriate earlier stage (e.g., Connecting...) and does not show \"Loading your profile...\".",
        "If the profile query errors (including timeout), the app shows StartupErrorScreen with a Retry action wired to re-run the profile query.",
        "The app does not render ProfileSetupDialog until it has definitively determined the profile is missing (i.e., after a successful fetch returning null)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add lightweight diagnostic details for the profile-loading stage to aid support/debugging without exposing secrets (e.g., show current startup stage and a short technical hint only on the error screen).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Nope still stuck on loading profile"
        ]
      },
      "acceptanceCriteria": [
        "When a startup error occurs at the profile-fetch stage, the error screen includes enough context to distinguish a timeout vs. authorization vs. generic failure (in user-safe language).",
        "No admin tokens, principals, or other secrets are displayed in the UI."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui (immutable paths).",
    "Backend must remain single-actor; only introduce backend changes if strictly necessary to resolve the profile loading hang."
  ],
  "nonGoals": [
    "Adding new authentication providers (only Internet Identity is in scope).",
    "Implementing real-time updates or WebSocket-based loading indicators.",
    "Redesigning unrelated pages (deals, buyers, contracts, membership) beyond what is necessary to resolve the profile loading hang."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}