{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wholesale Lens - Solid filled sidebar navigation button styling (desktop + mobile)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Refine sidebar navigation buttons to be clearly solid, filled, and visually consistent across default/hover/focus/active states in light/dark mode for both desktop sidebar and mobile Sheet sidebar.",
      "acceptanceCriteria": [
        "All sidebar navigation buttons have a visibly solid (non-transparent) background fill in light mode and dark mode; underlying page content is not visible through them.",
        "Default, hover, focus, and active states are visually distinct and consistent across all sidebar buttons (including Admin Panel, Contact Support, and Sign Out).",
        "The same filled-in styling applies in the mobile sidebar (Sheet) as well as the desktop sidebar.",
        "No changes are made to any immutable frontend paths (e.g., frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Unify sidebar button markup to rely on a single shared styling contract for all nav items (including Admin Panel, Contact Support, Sign Out) by: (1) adding an explicit active flag (e.g., data-active and/or aria-current) per item, (2) applying a consistent base class list for all sidebar buttons, and (3) adding a dedicated modifier class for the destructive Sign Out button so hover/active states remain consistent and clearly filled in both desktop sidebar and mobile Sheet sidebar."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Strengthen sidebar nav button visual treatment by updating sidebar color tokens (e.g., --sidebar-nav / --sidebar-accent as needed) and expanding the .sidebar-nav-button component styles to enforce fully opaque backgrounds and consistent border/hover/focus/active states in both light and dark mode (including active styling via data-active/aria-current), ensuring underlying content is never visible through the buttons."
        }
      ]
    }
  ]
}