{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix deterministic post-login profile startup flow (Wholesale Lens)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make post-Internet Identity login startup deterministically route authenticated users to ProfileSetupDialog (no profile) or AppShell (profile), and recover cleanly on auth/session failures without getting stuck on the startup error screen.",
      "acceptanceCriteria": [
        "After signing in with Internet Identity, the app reaches either ProfileSetupDialog (if no profile exists) or AppShell (if a profile exists) without showing the startup error screen.",
        "If the backend returns null for getCallerUserProfile(), the UI shows ProfileSetupDialog rather than a generic startup error.",
        "If the backend call fails due to auth/session issues, the app performs sign-out recovery (clear identity + React Query cache) and returns the user to the sign-in screen without an infinite loop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Refactor the startup profile query to use the backend startup-safe capability (e.g., checkCallerUserProfileResult()) to reliably distinguish Saved vs FirstTime vs Anonymous, returning null only for true first-time users and throwing an auth-classified error for session/delegation/anonymous failures. Maintain principal-scoped React Query keying and dependency-aware isLoading/isFetched semantics as per the authorization component guidance. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust the post-login startup orchestration to consume the revised profile query states deterministically: show ProfileSetupDialog when the query is fetched and profile is null; render AppShell when profile exists; and on auth-classified failures execute sign-out recovery (clear identity + React Query cache) and return to SignInScreen without retry loops. Ensure retry clears the principal-scoped cached profile query before refetching. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve auth/session error classification during profile loading to trigger automatic sign-out recovery only for real identity/delegation failures while avoiding misclassification of first-time-user states.",
      "acceptanceCriteria": [
        "Profile-loading failures caused by expired/invalid delegations, anonymous caller, 401/403-style failures, or equivalent agent errors are recognized as auth errors and trigger automatic sign-out recovery.",
        "First-time users (no profile yet) do not trigger sign-out recovery; they are routed into ProfileSetupDialog.",
        "The startup error UI is only shown for non-auth failures (network/timeout/unexpected) after classification."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/authErrors.ts",
          "operation": "modify",
          "description": "Harden auth/session error detection to recognize common Internet Identity / agent delegation failure patterns (expired/invalid delegation, anonymous principal, forbidden/unauthorized equivalents) while avoiding false positives for first-time-user profile absence. Ensure this logic is used consistently by the startup flow. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure profile-loading logic emits correctly classified errors for auth vs network vs timeout vs unexpected (e.g., attach a stable errorType and preserve the original underlying error message for diagnostics), and that first-time-user states resolve to a successful null result rather than an auth error. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update startup error handling so auth-classified profile-loading failures trigger sign-out recovery (identity clear + React Query cache clear) and route to SignInScreen, while non-auth failures show StartupErrorScreen. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add actionable diagnostics to the startup error experience for profile-loading failures, including clear user messaging, sanitized technical details, and a retry that performs a true refetch.",
      "acceptanceCriteria": [
        "When profile loading fails, the error screen shows a clear English message appropriate to the classified error type (network/timeout/unexpected).",
        "The Technical Details accordion shows sanitized underlying error information sufficient to debug (e.g., the raw agent/canister error message) without exposing long secrets/tokens.",
        "The Retry button results in a real re-attempt to fetch the profile (clearing any stale cached profile result for the current principal first)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartupErrorScreen.tsx",
          "operation": "modify",
          "description": "Enhance StartupErrorScreen technical details to always include (a) the sanitized original underlying error message and (b) a short, explicit classification hint (network/timeout/auth/unexpected) derived from errorType, while keeping the primary message user-friendly. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Pass improved diagnostic payloads to StartupErrorScreen for profile-loading failures (user-friendly message + sanitized original error detail + classification hint). Ensure Retry clears the principal-scoped cached profile query result before re-attempting the profile fetch. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Preserve and surface the original backend/agent error message (separately from the user-friendly message) so StartupErrorScreen can display sanitized technical details and a classification hint without leaking secrets/tokens. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}