{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix startup auth gating and recovery for profile loading",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Gate caller profile loading so it only runs when an authenticated Internet Identity is present, preventing signed-out startup auth errors and showing SignInScreen instead.",
      "acceptanceCriteria": [
        "When the user is signed out (identity is undefined), the app does not call getCallerUserProfile and does not show the 'Unable to Start' error screen for profile loading; it shows SignInScreen.",
        "After signing in, the profile query runs and the app proceeds to AppShell or ProfileSetupDialog (or shows an error only if the authenticated profile fetch genuinely fails)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update useGetCallerUserProfile to only enable the React Query fetch when an authenticated Internet Identity is present (not merely when an anonymous actor is ready). Use the selected \"authorization\" component guidance to ensure the app requires login before accessing user profile data; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust startup stage logic so the app does not enter/await the profile-fetch stage when identity is not present, and continues to show SignInScreen for signed-out users. Ensure stage transitions stay consistent once identity becomes available after login."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a Sign Out recovery action to the startup error screen for authentication-related profile loading failures, clearing Internet Identity state and returning to sign-in without refresh.",
      "acceptanceCriteria": [
        "If startup fails at 'Profile loading' with an authentication-related error, the error UI includes a \"Sign Out\" button in addition to retry/support.",
        "Clicking \"Sign Out\" clears the Internet Identity session (calls the existing clear/logout flow) and the app returns to SignInScreen without requiring a manual refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StartupErrorScreen.tsx",
          "operation": "modify",
          "description": "Extend StartupErrorScreen to optionally render an English \"Sign Out\" CTA when the failure is authentication-related during profile loading, alongside existing Retry/Contact Support actions. Use the selected \"authorization\" component guidance about clearing cached application data on logout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the StartupErrorScreen \"Sign Out\" action to the existing Internet Identity clear/logout flow and ensure React Query cached data (including currentUserProfile) is cleared so the UI returns to SignInScreen without a manual refresh."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Normalize authentication-related errors from the profile fetch path so startup reliably detects them as auth issues and shows the correct 'Profile loading' guidance and recovery UI.",
      "acceptanceCriteria": [
        "Authentication failures originating from getCallerUserProfile (e.g., backend traps containing \"Unauthorized\" / \"Authentication required\") are mapped to a consistent error message that triggers the authentication recovery UI.",
        "Non-auth failures (timeouts, network errors) continue to show their appropriate messages and do not display the sign-out CTA unless the error is authentication-related."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/authErrors.ts",
          "operation": "create",
          "description": "Create a small shared utility to detect authentication-related failures (e.g., matching \"Unauthorized\", \"Authentication required\", and common backend trap text) and to support consistent classification across hooks and startup UI logic."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Use the new auth error utility to normalize getCallerUserProfile failures so authentication-related errors are consistently identified (without being collapsed into a generic \"Failed to load profile\" message), while preserving distinct handling for timeouts/network errors."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update profile-fetch startup error mapping to rely on the shared auth error utility, ensuring authentication issues produce the specific authentication guidance message and trigger the authentication recovery UI, while non-auth errors keep their appropriate messages."
        },
        {
          "path": "frontend/src/components/StartupErrorScreen.tsx",
          "operation": "modify",
          "description": "Use the shared auth error utility (or a passed-in boolean) to decide when to show authentication-specific guidance and the \"Sign Out\" CTA only for authentication-related failures, keeping other error types on the existing retry/support pattern."
        }
      ]
    }
  ]
}