{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Wholesale Lens - Fix sidebar navigation, responsive layout, and navigation-breaking UI errors",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Ensure sidebar navigation always switches the main content view (no 'stuck in sidebar' rendering) and keeps main panel visible.",
      "acceptanceCriteria": [
        "From the authenticated shell, clicking each navigation item (Dashboard, Deal Analyzer, Deals Pipeline, Buyers List, Contracts, Analytics, Membership, Admin Panel) updates the active state in the sidebar and renders the correct page in the main content area.",
        "The main content area remains visible and usable after navigation (not overlapped/hidden by the sidebar).",
        "Navigation continues to work after repeated switching between multiple pages without requiring a refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Fix layout and view-switching reliability by ensuring the selected page renders only in the main content area, adding necessary flex/min-width/overflow guards (e.g., main content min-w-0) to prevent the sidebar from overlapping or visually trapping content, and keeping the active nav state in sync with the rendered PageComponent."
        },
        {
          "path": "frontend/src/components/AppShellErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a small React error boundary component that can wrap the main content renderer so that if any page throws during render, a user-facing fallback is shown instead of a blank or broken main pane."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Wrap the lazy-loaded PageComponent render with the new AppShellErrorBoundary to prevent unhandled exceptions from causing a blank main content area during navigation."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Make the sidebar responsive with a mobile drawer that can open/close and auto-closes on navigation without breaking the desktop persistent sidebar layout.",
      "acceptanceCriteria": [
        "On small screens, the navigation can be toggled open and closed, and the main content remains accessible.",
        "When a user selects a navigation item on small screens, the navigation closes (or otherwise gets out of the way) and the chosen page content is visible.",
        "The desktop layout keeps a persistent sidebar and does not regress."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Implement responsive sidebar behavior: keep the existing persistent sidebar for desktop widths, and add a mobile drawer/collapsible mode with a toggle button in a small-screen header; selecting a nav item should also close the drawer. Use shadcn-ui primitives already available in the project (e.g., Sheet/Drawer patterns if present) to implement the drawer behavior. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useMediaQuery.ts",
          "operation": "create",
          "description": "Add a lightweight media-query hook to reliably detect small screens for toggling drawer behavior and for auto-close rules after navigation."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Wire the new useMediaQuery hook into the AppShell so the sidebar toggle UI and auto-close behavior only apply on small screens while preserving the desktop persistent sidebar layout."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Eliminate runtime/UI errors during authenticated shell usage and page switching, including fixing broken routes and adding safe fallbacks for page-load failures.",
      "acceptanceCriteria": [
        "Basic authenticated flow works end-to-end: sign in, land in the app shell, switch pages from the navigation, and interact with scrollable content without crashes.",
        "No navigation action results in a blank main pane due to an unhandled exception.",
        "Any existing navigation-related console errors (errors thrown during render, click handlers, or lazy loading of pages) are eliminated or handled with a user-facing fallback state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Fix the payment failure route check to match the actual failure page path (use '/payment-failure' rather than '/payment-cancel') so authenticated navigation to payment result pages does not silently fail or render the wrong screen."
        },
        {
          "path": "frontend/src/components/AppShellErrorBoundary.tsx",
          "operation": "create",
          "description": "Ensure the error boundary fallback UI provides an actionable recovery path (e.g., a button to return to Dashboard) and does not throw additional errors; keep all user-facing text in English."
        },
        {
          "path": "frontend/src/components/AppShell.tsx",
          "operation": "modify",
          "description": "Harden page switching by adding a defensive fallback when the selected PageComponent is missing/undefined and by ensuring Suspense fallback and error boundary cover lazy-load failures, preventing blank main pane and blocking console errors during repeated navigation."
        }
      ]
    }
  ]
}