{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix intermittent profile loading failure blocking login (frontend hardening)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make startup profile loading reliable and ensure existing users reach the app shell while first-time users are routed to profile setup, with a functional Retry that does not require refresh.",
      "acceptanceCriteria": [
        "After signing in with Internet Identity, the app reaches the main application shell without showing the \"Failed to load your profile\" startup error for existing users with profiles.",
        "If the user has no profile yet, the app shows the profile setup dialog instead of the startup error screen.",
        "If the backend is unreachable or the call genuinely fails, the error screen shows the correct stage (\"Profile loading\") and the Retry button successfully retries the profile fetch without requiring a full page refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the profile query used at startup: (1) include the authenticated principal in the React Query key to prevent cross-identity cache bleed; (2) refine \"no profile\" detection without converting genuine failures into null; (3) add a lightweight, deterministic fallback check using existing backend capabilities (e.g., isFirstTimeUser()/hasUserProfile()) to decide whether an auth-like failure should route to profile setup vs be treated as a true authentication failure; (4) ensure the query never hangs by keeping the existing timeout and avoiding indefinite retries. Use the selected \"authorization\" component guidance for profile setup gating/caching semantics; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust startup orchestration to eliminate intermittent profile-loading dead-ends: ensure the app transitions to the main AppShell only when a non-null profile is present; ensure first-time users (null profile) always render ProfileSetupDialog; make Retry for the \"profile-fetch\" stage clear any stale/cached profile query state and then refetch without a full reload; preserve the stage value as 'profile-fetch' so StartupErrorScreen renders 'Profile loading'. Use the selected \"authorization\" component recovery guidance (clear cached application data on logout); verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Improve auth/permission error detection during profile fetch so auth-related failures trigger sign-out and return users to sign-in instead of leaving them stuck at profile loading.",
      "acceptanceCriteria": [
        "When the profile fetch fails due to an auth/permission error, the app automatically runs the sign-out recovery flow and returns the user to the sign-in screen.",
        "The startup error screen does not repeatedly appear for auth-related profile fetch errors; the user is instead guided back to sign-in.",
        "All user-facing messages remain in English (including any newly added error messages)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/authErrors.ts",
          "operation": "modify",
          "description": "Broaden and standardize auth/permission error classification for frontend recovery: detect common authorization/authentication failure strings (e.g., unauthorized/authentication required/permission denied/forbidden/401/403-like text, delegation expired/invalid identity/anonymous caller) while avoiding misclassifying first-time onboarding states. Keep all user-facing messages in English. Use the selected \"authorization\" component guidance for handling backend trap messages gracefully; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update profile-fetch error handling to propagate auth failures in a way App.tsx can consistently recognize (e.g., preserve original error message and/or wrap in a dedicated error type), while still allowing true first-time users to reach profile setup (null profile) when appropriate. Use the selected \"authorization\" component guidance for login gating and cache clearing; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure startup profile error handling uses the updated auth error classifier and reliably triggers the sign-out recovery flow for auth-related profile fetch failures (clear Internet Identity session + clear React Query cache + return to sign-in) rather than showing the startup error screen repeatedly. Use the selected \"authorization\" component logout/cached-data clearing guidance; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add lightweight, safe diagnostics for profile loading failures and make Retry clear stale query state before refetching.",
      "acceptanceCriteria": [
        "When profile loading fails, the startup error screen includes a technical detail string that helps distinguish timeout vs network vs auth vs unexpected errors.",
        "Clicking Retry from a profile-loading failure clears the cached profile query and successfully re-attempts the request.",
        "No sensitive values (tokens, secrets, raw credentials) are displayed in the technical detail."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Capture actionable diagnostics for profile-loading failures: log the original error object to the console (for developer debugging), and compute a sanitized technicalDetail string (no secrets) that includes a clear classification (timeout vs network vs auth vs unexpected) plus a minimal error summary. Ensure Retry cancels and removes the cached 'currentUserProfile' query state before refetching. Use the selected \"authorization\" component guidance to clear cached profile data on logout/recovery; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/StartupErrorScreen.tsx",
          "operation": "modify",
          "description": "Display the provided technicalDetail on the startup error screen in a safe, readable way (e.g., a details/expandable section or secondary text block), and keep existing stage mapping so 'profile-fetch' displays as 'Profile loading'. Ensure the UI does not reveal sensitive values and remains English-only. Verify shadcn/ui components are not modified (compose only) and verify any relevant selected component usage instructions before implementing."
        }
      ]
    }
  ]
}